import requests

headers = {
    'accept': 'application/json',
    'Content-Type': 'application/json',
}

json_data = {
    'title': 'Одного разу в Голлівуді from python',
    'description': 'Любовний лист Голлівуду шістдесятих, глибоке занурення у кінематографічний світ його золотої доби, винахідливий гумор – усе це в першому романі Квентіна Тарантіно, де він, не обмежений рамками хронометражу, розгортає епічне полотно сонячних спогадів свого дитинства. Знайомі глядачам однойменного фільму серіальний актор Рік Долтон та його дублер (герой війни чи вбивця?) Кліф Бут вписані у дбайливо відтворений стро\xadкатий пейзаж Лос-Анджелеса 1969 року, де їхні сусіди — блискучий Роман Поланскі й красуня Шерон Тейт, де тривожною музичною темою звучить історія Чарлі Менсона та його одержимиць, де знімаються куль\xadтові стрічки й серіали-одноденки, де мимобіжно присутній і сам автор — шестирічним хлоп\xadчиком, для якого вітчим бере автограф у одного з його улюблених акторів. Відомий глядачам сюжет і фірмові, миттєво впізнавані діалоги у книзі роз\xadкриваються по-новому, стаючи фундаментом міцно настояної, сінефільсько зарядженої «режисерської версії» фільму, яка відкриває читачеві «розширений всесвіт Голлівуду» від Тарантіно.',
    'price': 400,
    'image': 'https://s.ababahalamaha.com.ua/images/o/file_1_69.jpg',
}

response = requests.put('http://127.0.0.1:9000/api/books/cfd7bcec7456406fba5a6eb6d16b756e', headers=headers, json=json_data)

# Note: json_data will not be serialized by requests
# exactly as it was in the original request.
#data = '{\n  "title": "Одного разу в Голлівуді",\n  "description": "Любовний лист Голлівуду шістдесятих, глибоке занурення у кінематографічний світ його золотої доби, винахідливий гумор – усе це в першому романі Квентіна Тарантіно, де він, не обмежений рамками хронометражу, розгортає епічне полотно сонячних спогадів свого дитинства. Знайомі глядачам однойменного фільму серіальний актор Рік Долтон та його дублер (герой війни чи вбивця?) Кліф Бут вписані у дбайливо відтворений стро\xadкатий пейзаж Лос-Анджелеса 1969 року, де їхні сусіди — блискучий Роман Поланскі й красуня Шерон Тейт, де тривожною музичною темою звучить історія Чарлі Менсона та його одержимиць, де знімаються куль\xadтові стрічки й серіали-одноденки, де мимобіжно присутній і сам автор — шестирічним хлоп\xadчиком, для якого вітчим бере автограф у одного з його улюблених акторів. Відомий глядачам сюжет і фірмові, миттєво впізнавані діалоги у книзі роз\xadкриваються по-новому, стаючи фундаментом міцно настояної, сінефільсько зарядженої «режисерської версії» фільму, яка відкриває читачеві «розширений всесвіт Голлівуду» від Тарантіно.",\n  "price": 400,\n  "image": "https://s.ababahalamaha.com.ua/images/o/file_1_69.jpg"\n}'.encode()
#response = requests.put('http://127.0.0.1:9000/api/books/cfd7bcec7456406fba5a6eb6d16b756e', headers=headers, data=data)